"""
условие: https://contest.yandex.ru/contest/26133/problems/B/
ссылка на посылку: https://contest.yandex.ru/contest/26133/run-report/146643158/

-- ПРИНЦИП РАБОТЫ --

Я реализовал алгоритм проверки возможности разбиения строки T на слова из словаря.
Для этого используется структура данных "бор" (trie) вместе с динамическим программированием (dp).

Бор - это дерево, где каждый узел хранит ссылки на потомков (буквы) и флаг конца слова.
Если по пути от корня до текущего узла получается слово из словаря, этот узел помечается как конечный.

На первом этапе программа строит бор: для каждого слова из списка создаются переходы по буквам.
Если нужного перехода нет, он добавляется. На последнем символе слова ставится отметка конца (end = True).

Дальше проверяется, можно ли из этих слов составить исходную строку T.
Для этого используется массив dp длиной T + 1, где:
dp[i] = True, если первые i символов строки можно разбить на слова из словаря.

База динамики: dp[0] = True (пустая строка всегда составима).
Далее идём по всей строке: если dp[i] == True, значит, всё до позиции i уже можно собрать.
Теперь пробуем найти следующее слово, начиная с позиции i.
Для этого двигаемся по бору символ за символом.
Если текущей буквы нет в потомках - выходим из внутреннего цикла (так как дальше слова не будет).
Если дошли до узла, помеченного как конец слова (end = True),
значит, подстрока T[i:j+1] - это слово из словаря.
В этом случае ставим dp[j+1] = True, чтобы отметить, что и префикс длиной j+1 теперь составим.

После прохода всей строки ответом является dp[len(T)].
Если True - строку можно разбить, иначе - нет.

-- ДОКАЗАТЕЛЬСТВО КОРРЕКТНОСТИ --

Алгоритм корректен, потому что на каждом шаге мы сохраняем инвариант:
dp[i] = True тогда и только тогда, когда первые i символов строки можно составить из слов словаря.

Начальное значение dp[0] = True корректно, так как пустая строка не требует слов.
Дальше, если dp[i] = True и существует слово T[i:j+1], найденное в боре,
то логично, что и префикс длиной j+1 также составим - ставим dp[j+1] = True.
Таким образом, после обработки всех позиций dp[len(T)] будет True тогда и только тогда,
когда вся строка разбивается корректно.

-- ВРЕМЕННАЯ СЛОЖНОСТЬ --

Пусть:
t - длина строки T (<= 10^5),
n - количество слов в словаре (<= 10^2),
L - максимальная длина слова (<= 10^2).

Построение бора: каждое слово вставляется за O(L), всего слов n => получаем сложность O(n * L)
Проверка строки: для каждой позиции i проверяем не более L символов вперёд (так как длиннее слов нет) =>
=> в худшем случае O(t * L)

=> Общая временная сложность:
O(n * L + t * L) = O(L * (n + t))

-- ПРОСТРАНСТВЕННАЯ СЛОЖНОСТЬ --

Итоговая пространственная сложность формируется из:
 - хранение бора: для всех слов требуется O(n * L) памяти
 - хранение массива dp длиной t => O(t) памяти
=> O(t + n * L)

"""


class Trie:
    def __init__(self):
        self.child = {}
        self.end = False

    def insert(self, word):
        node = self
        for ch in word:
            node = node.child.setdefault(ch, Trie())
        node.end = True


def if_text_splittable(text: str, words: list[str]) -> bool:
    T = len(text)
    root = Trie()
    for w in words:
        root.insert(w)

    dp = [False] * (T + 1) # +1 для пустой строки
    dp[0] = True # пустая строка всегда составима

    for i in range(T):
        if dp[i]:
            node = root
            for j in range(i, T):
                ch = text[j]
                if ch not in node.child:
                    break
                node = node.child[ch]
                if node.end:
                    dp[j + 1] = True
    return dp[T]


def main():
    T = input().strip()
    n = int(input())
    words = [input().strip() for _ in range(n)]

    if_T_splittable = if_text_splittable(T, words)

    print("YES" if if_T_splittable else "NO")


if __name__ == "__main__":
    main()
