"""
Чтобы подготовиться к семинару, Гоше надо прочитать статью по эффективному менеджменту. Так как Гоша хочет спланировать
день заранее, ему необходимо оценить сложность статьи.

Он придумал такой метод оценки: берётся случайное предложение из текста и в нём ищется самое длинное слово. Его длина
и будет условной сложностью статьи.

Помогите Гоше справиться с этой задачей.

В первой строке дана длина текста L (1 ≤ L ≤ 105).

В следующей строке записан текст, состоящий из строчных латинских букв и пробелов. Слово —– последовательность букв,
не разделённых пробелами. Пробелы могут стоять в самом начале строки и в самом её конце. Текст заканчивается переносом
строки, этот символ не включается в число остальных L символов.

В первой строке выведите самое длинное слово. Во второй строке выведите его длину. Если подходящих слов несколько,
выведите то, которое встречается раньше.
"""
def get_longest_word(string: str) -> str:
    words = string.split()
    longest_word = words[0]

    for word in words[1:]:
        if len(word) > len(longest_word):
            longest_word = word

    return longest_word


input()
string = input()
longest_word = get_longest_word(string)
max_len = len(longest_word)
print(longest_word)
print(max_len)